[
  {
    "title": "Lively Living",
    "slug": "lively-living",
    "blurb": "Modern living room furniture collection",
    "details": [
      {
        "image": "lively-living-1.jpg",
        "caption": "Lively Living is a living room furniture collection that is meant to reduce the likelihood of ruining important items from being knocked over and at the same time to add life into the inanimate objects we usually have in the living room. The two pieces were made with animal-like characteristics without adding literal animal features. I wanted to make a collection that had a unique modern design look, and was functional. Both the table and lamp were made from ash wood.​​​​​​​"
      },
      {
        "imageSet": [
          [
            "lively-living-process-1.jpg",
            "lively-living-process-2.jpg",
            "lively-living-process-3.jpg",
            "lively-living-process-4.jpg",
            "lively-living-process-5.jpg",
            "lively-living-process-6.jpg",
            "lively-living-process-7.jpg",
            "lively-living-process-8.jpg"
          ]
        ],
        "caption": "**Inspiration**\n\nSome of my inspiration came from visiting modern furniture stores such as West Elm, Crate & Barrel, and BoConcept.",
        "aspectRatio": "23%"
      },
      {
        "imageSet": [
          [
            "lively-living-process-9.jpg",
            "lively-living-process-10.jpg",
            "lively-living-process-11.jpg"
          ],
          [
            "lively-living-process-12.jpg",
            "lively-living-process-13.jpg"
          ]
        ],
        "caption": "**Prototyping**\n\nOne of the biggest lessons I learned from this project is that the prototyping process can be messy and will not always necessarily flow smoothly from the sketching phase to the prototyping phase. Many times, I had to flip flop between sketching, making mini prototypes, and making full scale prototypes in order to visualize the whole design because designs don’t usually translate very well between 2D and 3D.",
        "aspectRatio": "50%"
      },
      {
        "imageSet": [
          [
            { "asset": "lively-living-process-14.jpg", "width": "26%" },
            { "asset": "lively-living-process-15.jpg", "width": "26%" },
            { "asset": "lively-living-process-16.jpg", "width": "11%" },
            { "asset": "lively-living-process-17.jpg", "width": "26%" },
            { "asset": "lively-living-process-18.jpg", "width": "11%" }
          ]
        ],
        "aspectRatio": "23%"
      },
      {
        "image": "lively-living-2.jpg",
        "caption": "**Table**\n\nThe table made for this collection has two layers in order to give objects set on the tables separation. More than once I have knocked a cup of water over on a table, and had to scramble to make sure that no electronics or books were going to get damaged. With this table, you can put more valuable objects on the top layer, and then keep your drinks and other less valuable items on the bottom layer without worrying about accidental spills if you knock your drink over."
      },
      {
        "imageSet": [
          [
            "lively-living-3.jpg",
            "lively-living-4.jpg"
          ],
          [
            "lively-living-5.jpg",
            "lively-living-6.jpg"
          ]
        ]
      },
      {
        "image": "lively-living-7.jpg",
        "caption": "**Lamp**\n\nI originally wanted to design a lamp that would go on top of the table, but I realized that having a lamp on top of the table would make the collection look cluttered, and also increase the chance of knocking something over higher. A floor lamp is harder to knock over, and visually goes with the collection better."
      },
      {
        "imageSet": [
          [
            "lively-living-8.jpg",
            "lively-living-9.jpg"
          ]
        ]
      },
      {
        "imageSet": [
          [
            "lively-living-9.jpg",
            "lively-living-10.jpg"
          ]
        ]
      },
      {
        "image": "lively-living-11.jpg"
      }
    ]
  },
  {
    "title": "Porsche Watering Can",
    "slug": "porsche-watering-can",
    "blurb": "Evoking a brand through design language",
    "details": [
      {
        "image": "porsche-1.jpg",
        "caption": "The watering can project was a branding exercise where we were challenged to convey an existing brand's design language through a watering can. I chose Porsche because I was interested in the way different curves flow smoothly into one another in their car designs. I enjoyed exploring how Porsche cars, both new and old, have their curved designs punctuated by the occasional sharp edge."
      },
      {
        "imageSet": [
          [
            { "asset": "porsche-inspiration-1.jpg", "width": "60%" },
            { "asset": "porsche-inspiration-2.jpg", "width": "40%" }
          ],
          [
            { "asset": "porsche-inspiration-3.jpg", "width": "55%" },
            { "asset": "porsche-inspiration-4.jpg", "width": "45%" }
          ]
        ],
        "caption": "**Inspiration**",
        "aspectRatio": "60%"
      },
      {
        "imageSet": [
          [
            "porsche-process-1.jpg",
            "porsche-process-2.jpg"
          ],
          [
            { "asset": "porsche-process-3.jpg", "width": "55%" },
            { "asset": "porsche-process-4.jpg", "width": "45%" }
          ]
        ],
        "caption": "**Sketches & Prototypes**",
        "aspectRatio": "60%"
      },
      {
        "imageSet": [
          [
            "porsche-process-5.jpg",
            "porsche-process-6.jpg",
            "porsche-process-7.jpg"
          ],
          [
            "porsche-process-8.jpg",
            "porsche-process-9.jpg",
            "porsche-process-10.jpg"
          ]
        ],
        "caption": "**Process**\n\nTo create the form, I carved the main shape out of blue foam and wood, and then spackled it. In order to remove imperfections, I sprayed the form with grey primer, so that imperfections would become visible, and then sanded the imperfections down. Finally, I attached the handle and sprayed the entire form with a metallic grey finish.",
        "aspectRatio": "50%"
      },
      {
        "imageSet": [
          [
            "porsche-process-11.jpg",
            "porsche-process-12.jpg"
          ]
        ],
        "aspectRatio": "33%"
      },
      {
        "imageSet": [
          [
            "porsche-2.jpg",
            "porsche-3.jpg",
            "porsche-4.jpg"
          ],
          [
            { "asset": "porsche-5.jpg", "width": "20%" },
            { "asset": "porsche-6.jpg", "width": "40%" },
            { "asset": "porsche-7.jpg", "width": "40%" }
          ]
        ],
        "caption": "**Final Form**",
        "aspectRatio": "55%"
      },
      {
        "image": "porsche-8.jpg"
      }
    ]
  },
  {
    "title": "Metals Exploration",
    "slug": "metals-exploration",
    "blurb": "An exploratory project using aluminium and steel",
    "details": [
      {
        "image": "metals-1.jpg",
        "caption": "This piece was made as the final project of my Metals II class. For this project, I machined aluminum and steel on several machines, including a vertical milling machine and a lathe, in order to explore different techniques taught in the class, and to better understand the capabilities of the machines and the materials. Since I wasn’t constrained to making a functional item, I had a great deal of freedom to explore many different things, but I still ended up making a cohesive item."
      },
      {
        "imageSet": [
          [
            { "asset": "metals-process-1.png", "width": "26.75%" },
            { "asset": "metals-process-2.jpg", "width": "26.75%" },
            { "asset": "metals-process-3.png", "width": "46.5%" }
          ]
        ],
        "caption": "**Original Drawings**",
        "aspectRatio": "33%"
      },
      {
        "imageSet": [
          [
            "metals-process-4.jpg",
            "metals-process-5.jpg"
          ],
          [
            "metals-process-6.jpg",
            "metals-process-7.jpg"
          ]
        ],
        "caption": "**Process**",
        "aspectRatio": "60%"
      },
      {
        "image": "metals-2.jpg",
        "caption": "**Final**\n\nUsing many different techniques in this project helped me understand the importance of order of operations and tolerance in manufacturing. The press-fitted piece, which is the bottom piece, wasn’t initially planned, but I saw an opportunity to use press-fitting during the build process, and I thought it would be valuable to explore that technique as well."
      },
      {
        "image": "metals-3.jpg"
      },
      {
        "image": "metals-4.jpg"
      },
      {
        "image": "metals-5.jpg"
      },
      {
        "image": "metals-6.jpg"
      },
      {
        "video": "metals-video-1.mp4",
        "caption": "The cap on top also wasn’t included as part of my initial plans, but at the last minute I felt like the object wasn’t complete, so I decided to make that component. It ended up being one of the more interesting parts of this project -- as shown in the video, it’s flippable and makes a clinking sound."
      },
      {
        "video": "metals-video-2.mp4"
      }
    ]
  },
  {
    "title": "Forms Study",
    "slug": "form-study",
    "blurb": "Conveying words through forms",
    "details": [
      {
        "image": "forms-1.jpg",
        "caption": "This project was an exercise to understand form language. We had to make 3 different forms of different sizes in order to convey two words that we had to work off of for the form family. The two words I worked with were \"calm\" and \"cascade.\""
      },
      {
        "imageSet": [
          [
            "forms-process-1.jpg",
            "forms-process-2.jpg"
          ],
          [
            "forms-process-3.jpg",
            "forms-process-4.jpg"
          ]
        ],
        "caption": "**Process**",
        "aspectRatio": "60%"
      },
      {
        "imageSet": [
          [
            "forms-2.jpg",
            "forms-3.jpg",
            "forms-4.jpg"
          ],
          [
            "forms-5.jpg",
            "forms-6.jpg",
            "forms-7.jpg"
          ]
        ],
        "caption": "**Final Forms**"
      },
      {
        "image": "forms-8.jpg"
      },
      {
        "imageSet": [
          [
            "forms-9.jpg",
            "forms-10.jpg",
            "forms-11.jpg"
          ],
          [
            "forms-12.jpg",
            "forms-13.jpg",
            "forms-15.jpg"
          ]
        ]
      },
      {
        "image": "forms-16.jpg"
      },
      {
        "imageSet": [
          [
            "forms-17.jpg",
            "forms-18.jpg",
            "forms-19.jpg"
          ],
          [
            "forms-20.jpg",
            "forms-21.jpg",
            "forms-22.jpg"
          ]
        ]
      },
      {
        "image": "forms-23.jpg"
      },
      {
        "image": "forms-24.jpg"
      },
      {
        "image": "forms-25.jpg"
      }
    ]
  },
  {
    "title": "Waffle Crisps",
    "slug": "waffle-crisps",
    "blurb": "Reducing food industry waste",
    "details": [
      {
        "image": "waffle-crisps-1.png",
        "caption": "This project was for a class called Playing in the Kitchen, where we designed products and systems related to food and beverages. We were assigned to do two potentially related projects throughout the semester, and we had the freedom to choose what we were interested in studying. For the first project, I decided to focus on how coffee shops use their refillable mugs and bottles systems. I discovered that a lot of coffee shops do not actually advertise the discounts that they give on bringing a reusable beverage container, and if they did, the information would be somewhere extremely unnoticeable. This made me realize that the food and beverage industry was a huge contributor to the amount of trash being thrown into the landfills all the time."
      },
      {
        "image": "waffle-crisps-2.png",
        "caption": "For my second project, I decided that I wanted to make a product that would potentially help reduce the problem. My Waffle Crisps idea came from the intention to reduce the amount of plastic spoons being thrown into the trash in ice cream stores. Even though I did make packaging for it, I believe that Waffle Crisps would be most effective in reducing plastic trash if it were to either be given out or sold in ice cream shops along with the ice cream you order."
      },
      {
        "imageSet": [
          [
            "waffle-crisps-process-1.jpg",
            "waffle-crisps-process-2.png"
          ]
        ],
        "caption": "**Process**\n\nThe first round of prototyping my Waffle Crisps was done in my kitchen with one waffle cone iron. The most difficult part was finding a recipe that not only tasted good and would not break when scooping, but would also be flexible enough to bend as soon as it came off the iron.",
        "aspectRatio": "30%"
      },
      {
        "image": "waffle-crisps-3.png",
        "caption": "**Packaging & Branding**"
      },
      {
        "imageSet": [
          [
            "waffle-crisps-1.png",
            "waffle-crisps-4.png"
          ]
        ],
        "aspectRatio": "50%"
      },
      {
        "image": "waffle-crisps-5.gif",
        "aspectRatio": "110%"
      },
      {
        "imageSet": [
          [
            "waffle-crisps-6.png",
            "waffle-crisps-7.png"
          ]
        ],
        "caption": "**Article**\n\nAfter both projects, we had to write [an article](/waffle-crisps.pdf) explaining why we did what we did. We also had design a mock-up of the article, as if it was published in some media source. I decided that Time Magazine was a good choice for my topic because the problem I was tackling is a serious issue, but with a fun twist.",
        "aspectRatio": "63%"
      }
    ]
  },
  {
    "title": "Modern Violin",
    "slug": "modern-violin",
    "blurb": "The violin reimagined with a modern twist",
    "details": [
      {
        "image": "modern-violin-1.png",
        "caption": "This is a fully functioning violin that is made to have a more modern style. The violin is asymmetrical to make it more comfortable for the player’s hand when going up to higher positions. The traditional scroll has been turned into a hook for easy carrying with one finger."
      },
      {
        "image": "modern-violin-process-1.jpg",
        "aspectRatio": "120%"
      },
      {
        "imageSet": [
          [
            "modern-violin-2.jpg",
            "modern-violin-3.jpg"
          ]
        ]
      },
      {
        "imageSet": [
          [
            "modern-violin-4.jpg",
            "modern-violin-5.jpg"
          ],
          [
            "modern-violin-6.jpg",
            "modern-violin-7.jpg"
          ]
        ],
        "aspectRatio": "60%"
      },
      {
        "imageSet": [
          [
            "modern-violin-8.jpg",
            "modern-violin-9.jpg"
          ]
        ]
      },
      {
        "image": "modern-violin-10.png",
        "aspectRatio": "50%"
      }
    ]
  },
  {
    "title": "How Do You Do Your Poo?",
    "slug": "ergonomic-toilet",
    "blurb": "A more ergonomic toilet",
    "details": [
      {
        "image": "toilet-1.png",
        "caption": "In many countries besides America, many people rely on squatting to facilitate elimination. Although many Americans realize that squatting is healthier, most of them don’t incorporate it into their daily routines. In response to this issue, I designed an ergonomic toilet that introduces the concept of squatting on the toilet in a familiar form."
      },
      {
        "image": "toilet-process-1.png",
        "caption": "**Research**",
        "aspectRatio": "90%"
      },
      {
        "image": "toilet-process-2.png",
        "caption": "**Ideation**",
        "aspectRatio": "85%"
      },
      {
        "image": "toilet-process-3.jpg",
        "aspectRatio": "50%"
      },
      {
        "image": "toilet-process-4.png",
        "caption": "**Final Sketch**",
        "aspectRatio": "60%"
      },
      {
        "image": "toilet-process-5.jpg",
        "caption": "**Model Making Process**",
        "aspectRatio": "55%"
      },
      {
        "image": "toilet-process-6.jpg",
        "aspectRatio": "55%"
      },
      {
        "image": "toilet-process-7.jpg",
        "aspectRatio": "55%"
      },
      {
        "image": "toilet-process-8.jpg",
        "aspectRatio": "55%"
      },
      {
        "imageSet": [
          [
            "toilet-2.png",
            "toilet-3.png"
          ]
        ],
        "caption": "**User Testing**"
      },
      {
        "imageSet": [
          [
            "toilet-4.png",
            "toilet-5.png"
          ]
        ],
        "aspectRatio": "60%",
        "caption": "**Final Model**"
      },
      {
        "image": "toilet-6.jpg"
      }
    ]
  },
  {
    "title": "Four Hour Children's Ride-On Challenge",
    "slug": "ride-on-challenge",
    "blurb": "A timed design challenge",
    "details": [
      {
        "image": "ride-on-1.jpg",
        "caption": "The goal of the Four Hour Children’s Ride-On Design Challenge was to design a ride-on toy that would either rock or roll in the given time. We worked in randomly assigned groups of three or four, and we had four hours to conceive ideas and also build a working prototype."
      },
      {
        "imageSet": [
          [
            "ride-on-process-1.jpg",
            "ride-on-process-2.jpg"
          ]
        ],
        "caption": "**Process**\n\nOriginally, my group wanted to make a ride-on car that could both rock and roll. One side would be shaped in a way that could rock without rocking too far, and would also have a foot rest. When flipped over, the toy would roll on a set of wheels mounted on the other side. During the course of creating our prototype, we realized that we did not have enough time or material to make the ride-on rock and roll, so with 45 minutes to go, we quickly decided to pivot our focus to making the ride-on just roll.",
        "aspectRatio": "33%"
      },
      {
        "image": "ride-on-process-3.jpg",
        "aspectRatio": "60%"
      },
      {
        "image": "ride-on-process-4.jpg"
      },
      {
        "image": "ride-on-2.jpg",
        "caption": "**User Testing**\n\nAfter four hours, we had a fully functioning ride-on to test with the kids. Almost immediately, we uncovered some major design flaws. What was originally intended to be the footrest part for the rocking position looked like a handle, so some kids started sitting in the car the wrong way, as they assumed the handles were for the person sitting in the car to hold on to"
      },
      {
        "image": "ride-on-3.gif",
        "caption": "Some parents also had the same misconception, and used the footrest as a handle to push their kids. This is a very uncomfortable position for the parent, although it is a good height for kids to push other kids around in. Another problem with the ride-on was that there was no safe place for the kids to rest their hands and feet. In the first video clip, you can see that the child’s feet are just running on the ground, and are also dangerously close to the wheel."
      },
      {
        "image": "ride-on-4.gif",
        "caption": "In the second video clip, the child sitting on the ride is seen struggling to find a place to put his hands. He first places his hands on the back wheel, but that is unsafe, and is directed to put his hands at the front of the car. That is uncomfortable for him, though, and he continues to struggle to find a place to rest his hands."
      }
    ]
  },
  {
    "title": "Dog Carrier for Bikes",
    "slug": "dog-carrier",
    "blurb": "Investigating creative ways to carry dogs",
    "details": [
      {
        "image": "dog-carrier-1.jpg",
        "caption": "This is a project that investigated creative ways to carry dogs. Through market research, I discovered that there were very few dog carriers that allowed people to conveniently carry both on and off a bike. This backpack design is meant to be comfortable for both the dog and the human, and also be very versatile for travel."
      },
      {
        "image": "dog-carrier-drawings.png",
        "caption": "**Orthographic Drawing, Material Reference, & Human Model**",
        "aspectRatio": "50%"
      },
      {
        "image": "dog-carrier-pattern-layout.png",
        "caption": "**Pattern Layout**",
        "aspectRatio": "60%"
      },
      {
        "image": "dog-carrier-process-1.png",
        "caption": "**Paper Prototyping**",
        "aspectRatio": "55%"
      },
      {
        "image": "dog-carrier-process-2.png",
        "aspectRatio": "33%"
      },
      {
        "imageSet": [
          [
            "dog-carrier-2.png",
            "dog-carrier-3.png"
          ],
          [
            "dog-carrier-4.png",
            "dog-carrier-5.png"
          ]
        ],
        "caption": "**Final Prototype**",
        "aspectRatio": "100%"
      }
    ]
  },
  {
    "title": "Deck",
    "slug": "deck",
    "blurb": "A contracting project",
    "details": [
      {
        "image": "deck-1.jpg",
        "caption": "A deck that I helped tear down and rebuild when I worked as a contractor's assistant."
      },
      {
        "image": "deck-process-1.jpg",
        "caption": "**Process**\n\nDuring the tear down process, we had to make sure that the structural integrity of the house wasn’t at risk. Only after reinforcing the deck did we start laying down floor boards.",
        "aspectRatio": "60%"
      },
      {
        "imageSet": [
          [
            "deck-process-2.jpg",
            "deck-process-3.jpg"
          ],
          [
            "deck-process-4.jpg",
            "deck-process-5.jpg"
          ],
          [
            { "asset": "deck-process-6.jpg", "width": "67%" },
            { "asset": "deck-process-7.jpg", "width": "33%" }
          ]
        ],
        "caption": "I also gained experience with hand and construction tools, as we needed to find a lot of creative ways to cut the materials we needed to the right size. Even though rebuilding a deck isn’t a typical design project, it was a valuable experience as I learned a lot about building projects on a large scale, as well as working with customers to meet deadlines.",
        "aspectRatio": "110%"
      },
      {
        "image": "deck-2.jpg",
        "aspectRatio": "55%"
      },
      {
        "imageSet": [
          [
            { "asset": "deck-3.jpg", "width": "67%" },
            { "asset": "deck-4.jpg", "width": "33%" }
          ]
        ],
        "caption": "**Finished Deck**",
        "aspectRatio": "55%"
      },
      {
        "imageSet": [
          [
            "deck-5.jpg",
            "deck-6.jpg"
          ]
        ]
      }
    ]
  },
  {
    "title": "Miscellaneous",
    "slug": "misc",
    "blurb": "Other work I've done",
    "noHover": true,
    "details": [
      {
        "image": "lock.jpg",
        "textFirst": true,
        "caption": "This section contains some other, smaller, things I've worked on.\n\n**Small to Large Lock**",
        "aspectRatio": "100%"
      },
      {
        "image": "some-drawings.png",
        "caption": "**Product Drawings**\n\nSome drawings I did for a workshop on sketching products.",
        "aspectRatio": "150%",
        "imageAlignment": "center -25px",
        "hasBorder": true
      },
      {
        "image": "metals-1-exploration.jpg",
        "caption": "**Metals 1 Exploration**"
      },
      {
        "video": "metals-1-exploration.mp4",
        "aspectRatio": "100%"
      },
      {
        "image": "oil-and-vinegar-forms.jpg",
        "caption": "**Oil and Vinegar Bottle Forms**"
      },
      {
        "image": "vacuum-1.jpg",
        "caption": "\n\n**Playskool Toy Vacuum Illustrator Drawings**\n\nOrthographic, In use, and exploded view illustrator drawings of a purple Playskool toy vacuum.",
        "aspectRatio": "118%"
      },
      {
        "image": "vacuum-2.png",
        "aspectRatio": "65%"
      },
      {
        "image": "vacuum-4.png",
        "aspectRatio": "180%"
      },
      {
        "image": "hedgehog.jpg",
        "caption": "**Hedgehog Push Toy**",
        "aspectRatio": "55%"
      },
      {
        "image": "fire-hydrant.jpg",
        "caption": "**Rhino Fire Hydrant**",
        "aspectRatio": "110%"
      },
      {
        "image": "paper-lamp.jpg",
        "caption": "**Paper Lamp**",
        "aspectRatio": "120%"
      },
      {
        "image": "elephant-push-pin.jpg",
        "caption": "**Elephant Push Pin**\n\nThis was a group project where we laser cut the form from a CAD model and covered it with nature-inspired paintings.",
        "aspectRatio": "55%"
      }
    ]
  }
]
